DELETE FROM VOTES;
DELETE FROM USERS;
DELETE FROM DISHES;
DELETE FROM RESTAURANTS;

ALTER SEQUENCE GLOBAL_SEQ
RESTART WITH 100000;

INSERT INTO USERS (name, email, password) VALUES
  ('User1', 'user1@yandex.ru', 'password'),
  ('User2', 'user2@yandex.ru', 'password'),
  ('User3', 'user3@yandex.ru', 'password');

INSERT INTO USERS (name, email, password, is_admin) VALUES
  ('Admin', 'admin@gmail.com', 'admin', TRUE );

INSERT INTO RESTAURANTS (NAME) VALUES
  ('Ёлки-Палки'), -- 100004
  ('Fourth Michelin Star'), -- 100005
  ('Три пескаря'); -- 100006

INSERT INTO DISHES (DATE, NAME, PRICE, RESTAURANT_ID) VALUES
-- Ёлки-Палки
  ('2017-12-29', 'Оливье', 13025, 100004),
  ('2017-12-29', 'Холодец', 18630, 100004),
  ('2017-12-29', 'Мандаринка', 6000, 100004),
  ('2017-12-30', 'Оливье', 13025, 100004),
  ('2017-12-30', 'Холодец', 18630, 100004),
  ('2017-12-30', 'Мандаринка', 6000, 100004),
-- Fourth Michelin Star
  ('2017-12-29', 'Дефлопэ', 25000, 100005),
  ('2017-12-29', 'Семечки кациуса', 186.30, 100005),
  ('2017-12-29', 'Мандаринка', 600, 100005),
  ('2017-12-30', 'Дефлопэ', 25000, 100005),
  ('2017-12-30', 'Семечки кациуса', 186.30, 100005),
  ('2017-12-30', 'Мандаринка', 600, 100005),
-- Три пескаря
  ('2017-12-29', 'Три корочки хлеба', 7950, 100006),
  ('2017-12-29', 'Карась в сметане', 15000, 100006),
  ('2017-12-29', 'Морс', 500, 100006),
  ('2017-12-30', 'Три корочки хлеба', 7950, 100006),
  ('2017-12-30', 'Гефилте фиш', 20000, 100006),
  ('2017-12-30', 'Чай', 400, 100006);

--today
INSERT INTO DISHES (NAME, PRICE, RESTAURANT_ID) VALUES
  -- Ёлки-Палки
  ('Оливье', 13025, 100004),
  ('Холодец', 18630, 100004),
  ('Мандаринка', 6000, 100004),
  -- Fourth Michelin Star
  ('Дефлопэ', 25000, 100005),
  ('Семечки кациуса', 18630, 100005),
  ('Мандаринка', 1000, 100005),
  -- Три пескаря
  ('Три корочки хлеба', 7950, 100006),
  ('Селедка под шубой', 16080, 100006),
  ('Мандаринка', 700, 100006);

INSERT INTO VOTES (USER_ID, RESTAURANT_ID, DATE) VALUES
  (100000,100004,'2017-12-29'),
  (100001,100005,'2017-12-29'),
  (100002,100006,'2017-12-29'),
  (100000,100004,'2017-12-30'),
  (100001,100005,'2017-12-30'),
  (100002,100005,'2017-12-30');

INSERT INTO VOTES (USER_ID, RESTAURANT_ID) VALUES
  (100000,100004),
  (100001,100004),
  (100002,100004);