DELETE FROM USER_ROLES;
DELETE FROM VOTES;
DELETE FROM USERS;
DELETE FROM DISHES;
DELETE FROM RESTAURANTS;

ALTER SEQUENCE GLOBAL_SEQ
RESTART WITH 100000;

INSERT INTO USERS (name, email, password) VALUES
  ('User1', 'user1@yandex.ru', 'password'),
  ('User2', 'user2@yandex.ru', 'password'),
  ('User3', 'user3@yandex.ru', 'password'),
  ('Admin', 'admin@gmail.com', 'admin');

INSERT INTO USER_ROLES (role, user_id) VALUES
  ('ROLE_USER', 100000),
  ('ROLE_USER', 100001),
  ('ROLE_USER', 100002),
  ('ROLE_ADMIN', 100003);

INSERT INTO RESTAURANTS (NAME) VALUES
  ('Ёлки-Палки'), -- 100004
  ('Fourth Michelin Star'), -- 100005
  ('Три пескаря'); -- 100006

INSERT INTO DISHES (DATE, NAME, PRICE, RESTAURANT_ID) VALUES
-- Ёлки-Палки
  ('2017-12-29 00:00:00', 'Оливье', 130.25, 100004),
  ('2017-12-29 00:00:00', 'Холодец', 186.30, 100004),
  ('2017-12-29 00:00:00', 'Мандаринка', 60.00, 100004),
  ('2017-12-30 00:00:00', 'Оливье', 130.25, 100004),
  ('2017-12-30 00:00:00', 'Холодец', 186.30, 100004),
  ('2017-12-30 00:00:00', 'Мандаринка', 60.00, 100004),
  ('2017-12-31 00:00:00', 'Оливье', 130.25, 100004),
  ('2017-12-31 00:00:00', 'Холодец', 186.30, 100004),
  ('2017-12-31 00:00:00', 'Мандаринка', 60.00, 100004),
-- Fourth Michelin Star
  ('2017-12-29 00:00:00', 'Дефлопэ', 250.00, 100005),
  ('2017-12-29 00:00:00', 'Семечки кациуса', 186.30, 100005),
  ('2017-12-29 00:00:00', 'Мандаринка', 60.0, 100005),
  ('2017-12-30 00:00:00', 'Дефлопэ', 250.00, 100005),
  ('2017-12-30 00:00:00', 'Семечки кациуса', 186.30, 100005),
  ('2017-12-30 00:00:00', 'Мандаринка', 60.0, 100005),
  ('2017-12-31 00:00:00', 'Дефлопэ', 250.00, 100005),
  ('2017-12-31 00:00:00', 'Семечки кациуса', 186.30, 100005),
  ('2017-12-31 00:00:00', 'Мандаринка', 100.0, 100005),
-- Три пескаря
  ('2017-12-29 00:00:00', 'Три корочки хлеба', 79.50, 100006),
  ('2017-12-29 00:00:00', 'Карась в сметане', 150.00, 100006),
  ('2017-12-29 00:00:00', 'Морс', 50.0, 100006),
  ('2017-12-30 00:00:00', 'Три корочки хлеба', 79.50, 100006),
  ('2017-12-30 00:00:00', 'Гефилте фиш', 200.00, 100006),
  ('2017-12-30 00:00:00', 'Чай', 40.0, 100006),
  ('2017-12-31 00:00:00', 'Три корочки хлеба', 79.50, 100006),
  ('2017-12-31 00:00:00', 'Селедка под шубой', 160.80, 100006),
  ('2017-12-31 00:00:00', 'Мандаринка', 70.0, 100006);

INSERT INTO VOTES (USER_ID, RESTAURANT_ID, DATE) VALUES
  (100000,100004,'2017-12-29 00:00:00'),
  (100001,100005,'2017-12-29 00:00:00'),
  (100002,100006,'2017-12-29 00:00:00'),
  (100000,100004,'2017-12-30 00:00:00'),
  (100001,100005,'2017-12-30 00:00:00'),
  (100002,100005,'2017-12-30 00:00:00'),
  (100000,100004,'2017-12-31 00:00:00'),
  (100001,100004,'2017-12-31 00:00:00'),
  (100002,100004,'2017-12-31 00:00:00');